Revit 2026 API

# MultipleValuesIndicationSettingsGetMultipleValuesIndicationSettings Method

---

Returns the MultipleValuesIndicationSettings element for a given document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static MultipleValuesIndicationSettings GetMultipleValuesIndicationSettings(
	Document cda
)
```
```vb
Public Shared Function GetMultipleValuesIndicationSettings (
	cda As Document
) As MultipleValuesIndicationSettings
```
```cpp
public:
static MultipleValuesIndicationSettings^ GetMultipleValuesIndicationSettings(
	Document^ cda
)
```
```fsharp
static member GetMultipleValuesIndicationSettings :
        cda : Document -> MultipleValuesIndicationSettings
```

#### Parameters

cda Document
     The document for which to get the MultipleValuesIndicationSettings element.

#### Return Value

MultipleValuesIndicationSettings

Returns the MultipleValuesIndicationSettings element in project documents or  for family documents

.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Project documents have a MultipleValuesIndicationSettings element, one per document. Family documents do not have MultipleValuesIndicationSettings elements.

#### Reference

MultipleValuesIndicationSettings Class

Autodesk.Revit.DB Namespace